scripts/load-test/reports/2026-05-28T05-33-38Z/01-landing-burst.txt
Running 30s test @ https://yi-connect-app.vercel.app/yip
100 connections


┌─────────┬───────┬────────┬────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 98 ms │ 215 ms │ 706 ms │ 1008 ms │ 259.24 ms │ 169.14 ms │ 2144 ms │
└─────────┴───────┴────────┴────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 66      │ 66      │ 416     │ 557     │ 403.07  │ 90.4    │ 66      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 4.57 MB │ 4.57 MB │ 28.8 MB │ 38.5 MB │ 27.9 MB │ 6.25 MB │ 4.56 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 11689 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 29

12k requests in 30.65s, 808 MB read