scripts/load-test/reports/2026-05-28T05-33-38Z/02-jury-login.txt
Running 30s test @ https://yi-connect-app.vercel.app/yip/jury/login
50 connections


┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 45 ms │ 55 ms │ 145 ms │ 191 ms │ 63.25 ms │ 31.03 ms │ 619 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 565    │ 565    │ 808    │ 869    │ 786.27 │ 66.79   │ 565    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 285 kB │ 285 kB │ 407 kB │ 438 kB │ 396 kB │ 33.7 kB │ 285 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 307  │ 23588 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

0 2xx responses, 23588 non 2xx responses
24k requests in 30.21s, 11.9 MB read