scripts/load-test/reports/2026-05-28T05-33-38Z/03-join-page.txt
Running 30s test @ https://yi-connect-app.vercel.app/yip/join
100 connections


┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬─────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max     │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼─────────┤
│ Latency │ 54 ms │ 94 ms │ 354 ms │ 450 ms │ 122.2 ms │ 83.67 ms │ 1098 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 377     │ 377     │ 761     │ 1,211   │ 828.77  │ 208.99  │ 377     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 10.8 MB │ 10.8 MB │ 21.9 MB │ 34.8 MB │ 23.8 MB │ 6.01 MB │ 10.8 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 24863 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

25k requests in 31.06s, 715 MB read