scripts/load-test/reports/2026-05-28T05-33-38Z/04-organiser-login.txt
Running 30s test @ https://yi-connect-app.vercel.app/yip/login
50 connections


┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬─────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max     │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼─────────┤
│ Latency │ 46 ms │ 61 ms │ 188 ms │ 268 ms │ 75.12 ms │ 47.99 ms │ 1193 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 278     │ 278     │ 682     │ 836     │ 665.67  │ 112.81  │ 278     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 8.74 MB │ 8.74 MB │ 21.4 MB │ 26.3 MB │ 20.9 MB │ 3.55 MB │ 8.74 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 19970 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

20k requests in 30.37s, 628 MB read